<?php
/**
 * Created by PhpStorm.
 * User: shpits
 * Date: 14.11.13
 * Time: 21:17
 */

namespace Acme\HelloBundle\Controller;


class ArrayCountryModel
{
    public function newArray()
    {
        $country = new CountryModel();
        $country->setName("Україна");
        $country->setCapital("Київ");
        $country->setPresident("Віктор Янукович");
        $country->setDescription(
            "Україна — держава у Східній Європі,
             у південно-західній частині Східноєвропейської рівнини.
             Площа становить 603 628 км². Найбільша країна,
             чия територія повністю лежить в Європі,
             друга країна за величиною на європейському континенті,
             якщо враховувати Росію. Межує з Росією на сході і північному сході,
             Білоруссю на півночі, Польщею, Словаччиною та Угорщиною — на заході,
             Румунією та Молдовою — на південному заході.
             На півдні і південному сході омивається Чорним й Азовським морями."
        );

        $country2 = new CountryModel();
        $country2->setName("Австралія");
        $country2->setCapital("Канберра");
        $country2->setPresident("Тоні Ебботт");
        $country2->setDescription(
            "Австралія  — держава у Південній півкулі Землі на Австралійському материку і острові Тасманія.
             До складу країни входять також багато невеликих островів,
             серед яких Норфолк і Лорд-Хау в Тихому океані,
             Кокосові острови в Індійському та інші.
             Найближчими сусідніми країнами є Індонезія,
             Східний Тимор і Папуа-Нова Гвінея на півночі,
             Соломонові острови, Вануату і Нова Каледонія на північному сході і Нова Зеландія на південному сході."
        );

        $country3 = new CountryModel();
        $country3->setName("Камбоджа");
        $country3->setCapital("Пномпень");
        $country3->setPresident("Хун Сен");
        $country3->setDescription(
            "Королівство Камбоджа - колишня Кхмерська Республіка 1970—1976 роки,
             Демократична Кампучія 1976—1979 роки, Народна Республіка Кампучія 1979—1989 рр.
             держава Південно-Східної Азії, що межує на півночі і північному заході із Таїландом,
             на півночі з Лаосом, на сході і південному сході з В’єтнамом та омивається на південному
             сході Південнокитайським морем; територія 181035 кв. км; столиця Пномпень."
        );
        return $arr = [$country, $country2, $country3];
    }
} 